test/coarseInflatedtabEOS/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 0.5;

vertices
(
    (0 0 0)
    (1 0 0)
    (2 0 0)
    (0 1 0)
    (1 1 0)
    (2 1 0)
    (0 2 0)
    (1 2 0)
    (2 2 0)
    (0 0 2)
    (1 0 2)
    (2 0 2)
    (0 1 2)
    (1 1 2)
    (2 1 2)
    (0 2 2)
    (1 2 2)
    (2 2 2)
);

n 50;
blocks
(
    hex (0 1 4 3 9 10 13 12) ($n $n 1) simpleGrading (1 1 1)
    hex (1 2 5 4 10 11 14 13) ($n $n 1) simpleGrading (1 1 1)
    hex (3 4 7 6 12 13 16 15) ($n $n 1) simpleGrading (1 1 1)
    hex (4 5 8 7 13 14 17 16) ($n $n 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom
    {
        type patch;
        faces
        (
            (3 0 12 9)
            (0 1 10 9)
        );
    }
    top
    {
        type patch;
        faces
        (
            (7 8 17 16)
            (5 8 17 14)
            (7 6 15 16)
            (2 5 14 11)
        );
    }
    left
    {
        type patch;
        faces
        (
            (3 6 15 12)
        );
    }
    right
    {
        type patch;
        faces
        (
            (1 2 11 10)
        );
    }
);

mergePatchPairs
(
);
