test/coarseInflatedtabEOS/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            myHeRhoThermo;
    mixture         myPureMixture;
    transport       const;
    thermo          eTabulated;
    equationOfState tabulatedEOS;
    specie          mySpecie;
    energy          tabulatedInternalEnergy;
}

// Assuming fully ionized flibe gas
mixture
{
    mySpecie
    {
        molWeight       7.;
    }
    

    equationOfState
    {
        pCoeffs
        {
            file       "constant/pIonBlendedExt.csv";
            mod         ln;
            delim       ",";
            isReal      false;
            flipTable   false;
        }

        rhoCoeffs
        {
            mod         log10;

            n           7;
            min         -5;
            delta       1;
            isReal      false;
        }
        eCoeffs
        {
            mod         ln;

            n           66;
            min         16;
            delta       0.1;
            isReal      false;
        }
    }
    thermodynamics
    {
        TCoeffs
        {
            file        "constant/TIonBlendedExt.csv";
            mod          ln;
            delim       ",";
            isReal      false;
            flipTable   false;
        }
         rhoCoeffs
        {
            mod         log10;

            n           7;
            min         -5;
            delta       1;
            isReal      false;
        }
        eCoeffs
        {
            mod         ln;

            n           66;
            min         16;
            delta       0.1;
            isReal      false;
        }
    }
    transport
    {
        mu  0;   
        Pr  1;
    }
}


// ************************************************************************* //
