test/coarseInflatedtabEOS/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall
    {
        type            noSlip;
    }

    "row.*"
    {
        type            noSlip;
    }

    slabs
    {
        type            noSlip;
    }

    symmetry_xz
    {
        type            symmetry;
    }
    symmetry_yz
    {
        type            symmetry;
    }
    
    topBottom
    {
        type            empty;
    }
}

// ************************************************************************* //
