test/coarseInflatedtabEOS/0/rho.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0.5313;

boundaryField
{
   wall
    {
        type            zeroGradient;
    }

    "row.*"
    {
        type            zeroGradient;
    }

    slabs
    {
        type            zeroGradient;
    }

    symmetry_xz
    {
        type            symmetry;
    }
    symmetry_yz
    {
        type            symmetry;
    }
    
    topBottom
    {
        type            empty;
    }
}

// ************************************************************************* //
