test/coarseInflatedtabEOS/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      Kurganov;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         cellMDLimited leastSquares 1.0;
}

divSchemes
{
    default         none;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}


interpolationSchemes
{
    default             linear;
    reconstruct(rho)    upwind;
    reconstruct(U)      upwind;
    reconstruct(e)      upwind;
    reconstruct(p)      upwind;
    reconstruct(T)      upwind;
    reconstruct(speedOfSound)      upwind;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
