test/coarseInflatedtabEOS/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "(rho|rhoU|rhoE|alpha)"
    {
        solver          diagonal;
    }
    "(rho|rhoU|rhoE|alpha)Final"
    {
        solver          diagonal;
    }
    "G.*"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance       1e-04;
        relTol          0.1;
    }
}

PIMPLE
{
    momentumPredictor true;
    nOuterCorrectors  2;
    nCorrectors     3;
    nNonOrthogonalCorrectors 1;
}


// ************************************************************************* //
